Repository: Toktarla/app_core
Catalog: lib/src/l10n/translations/intl_*.arb
Languages: kk

source: click here
kk: мында басыңыз

# continueText
source: Continue
kk: Жалғастыру

# enterSmsCodeSentToNumber
source: Enter the SMS code we sent to the number
kk: Біз жіберген SMS кодын енгізіңіз

source: Login and Registration
kk: Кіру және тіркелу

# noAccountRegisterService
source: No account yet? Register your service -
kk: Әлі аккаунтыңыз жоқ па? Өз ақпараттарыңызды тіркеңіз —

source: Phone Number
kk: Телефон нөмірі

source: Send code again
kk: Кодты қайта жіберу

# sendCodeAgainInSeconds
source: Send code again in 00:{seconds}
kk: Кодты 00:{seconds} кейін қайта жіберу

source: SMS Code
kk: SMS коды

source: Add
kk: Қосу

source: Apply
kk: Қолдану

source: Cancel
kk: Бас тарту

source: Confirm
kk: Растау

source: Delete
kk: Жою

source: Done
kk: Дайын

source: Edit
kk: Өңдеу

source: Exit
kk: Шығу

source: Hide
kk: Жасыру

source: Reset
kk: Қалпына келтіру

source: Retry
kk: Қайталау

source: Save
kk: Сақтау

source: Search
kk: Іздеу

source: Select
kk: Таңдау

source: Select all
kk: Барлығын таңдау

source: Unfold
kk: Ашу

source: Add online booking
kk: Онлайн жазылу қосу

source: Add to queue
kk: Кезекке қосу

# allowCameraAccess
source: Allow camera access to continue
kk: Жалғастыру үшін камераға кіруге рұқсат беріңіз

source: Awaiting
kk: Күтуде

source: Cash register
kk: Касса

source: Continue booking
kk: Жазылуды жалғастыру

source: Edit booking
kk: Жазылымды өңдеу

source: History
kk: Тарих

source: Journal
kk: Журнал

source: Live queue
kk: Тікелей кезек

source: Online booking
kk: Онлайн жазылу

# onlineBookingCreated
source: Online booking created successfully
kk: Онлайн жазылу сәтті жасалды

# orderAddedToQueue
source: Order successfully added to queue
kk: Тапсырыс кезекке сәтті қосылды

source: Order successfully updated
kk: Тапсырыс сәтті жаңартылды

source: Queue booking
kk: Кезекке жазылу

source: Scan successful
kk: Кодты сканерлеу сәтті өтті

source: Scanned
kk: Сканерленген

# selectDateTime
source: Select date and time
kk: Күн мен уақытты таңдау

source: Selected time:
kk: Таңдалған уақыт:

source: Time not selected
kk: уақыт таңдалмады

source: To select another time,
kk: Басқа уақытты таңдау үшін,

# addCar
source: Add a car
kk: Авто қосу

source: Car
kk: Авто

source: Car makes and models
kk: Автомобиль маркалары мен модельдері

source: Car services
kk: Автосервистер

source: Edit car
kk: Автоны өңдеу

source: Enter license plate
kk: Мемлекеттік нөмірді енгізіңіз

source: Generation
kk: Буын

source: License plate
kk: Мемлекеттік нөмір

source: Make
kk: Маркасы

source: Model
kk: Модель

source: Select car make and model
kk: Көлік маркасы мен моделін таңдаңыз

source: Select generation
kk: Буынды таңдаңыз

source: Select make
kk: Марканы таңдаңыз

source: Select model
kk: Модельді таңдаңыз

# totalCars
source: Cars: {totalCount}
kk: Автомобильдер: {totalCount}

source: Add client
kk: Клиент қосу

source: Client
kk: Клиент

source: Client found:
kk: Табылған клиент:

source: Client name
kk: Клиенттің аты

source: Clients
kk: Клиенттер

source: Edit client
kk: Клиентті өңдеу

source: No clients yet
kk: Әлі клиенттер жоқ

# totalClients
source: Clients: {totalObjects}
kk: Клиенттер: {totalObjects}

# addCompany
source: Add a company
kk: Компания қосу

source: Company name
kk: Компания атауы

source: Edit company
kk: Компанияны өңдеу

source: Enter company name
kk: Атауын енгізіңіз

source: Legal companies
kk: Заңды компаниялар

source: Legal entity
kk: Заңды тұлға

# legalEntityShort
source: Legal entity
kk: Заңды тұлға

source: Add employee
kk: Қызметкер қосу

# addAtLeastOneEmployee
source: To record clients in the journal, you need to add at least one washer employee. You can do this right now.
kk: Клиенттерді журналға жазу үшін кемінде бір жуындыру қызметкерін қосу қажет. Сіз мұны дәл қазір жасай аласыз.

# admin
source: Administrator
kk: Әкімші

source: Administrator
kk: Әкімші

source: Any
kk: Кез келген

source: Car washer
kk: Автожуушы

source: Car Washers
kk: Автожуушылар

source: Employee
kk: Қызметкер

# employeeListEmpty
source: Employee list is empty
kk: Қызметкерлер тізімі бос

source: Employee name
kk: Қызметкердің аты

source: Employee phone number
kk: Қызметкердің телефон нөмірі

source: Employee role
kk: Қызметкердің рөлі

source: Edit employee
kk: Қызметкерді өңдеу

source: Enter name
kk: Атын енгізіңіз

source: Enter phone number
kk: Телефон нөмірін енгізіңіз

# phoneNumberNotChangeable
source: Phone number cannot be changed. To change the number, delete the employee and add again.
kk: Телефон нөмірін өзгерту мүмкін емес. Нөмірді өзгерту үшін қызметкерді өшіріп, қайта қосыңыз.

source: Salary rate
kk: Жалақы мөлшері

source: Select employee
kk: Қызметкерді таңдаңыз

source: Select percentage
kk: Пайызды таңдаңыз

source: Select role
kk: Рөлді таңдаңыз

source: Staff
kk: Қызметкерлер

source: Back to home
kk: Басты бетке қайту

# badRequest
source: Invalid request, please check your data and try again
kk: Белгілі әрекет бұрыс орындалды, деректеріңізді тексеріп, қайталап көріңіз

# connectionTimeout
source: The server response time has expired
kk: Сервер жауап беру уақыты аяқталды

source: Error
kk: Қате

# errorType
source: Error Type: {error}
kk: Қате түрі: {error}

source: Initialization Failed
kk: Қосымша басталмады

# internalServerError
source: Please try again later, an internal error occurred
kk: Кейінірек қайталап көріңіз, ішкі қате пайда болды

# invalidRequestCheckData
source: Invalid request, check your data and try again
kk: Белгілі әрекет бұрыс орындалды, деректеріңізді тексеріп, қайталап көріңіз

source: No available data
kk: Қолжетімді деректер жоқ

source: No internet connection
kk: Интернет байланысы жоқ

# notFound
source: Data not found
kk: Деректер табылмады

source: Request Success
kk: Әрекет сәтті орындалды

source: Server response time expired
kk: Сервер жауап беру уақыты аяқталды

# serverUnavailableTryLater
source: Try again later, the server is currently unavailable
kk: Кейінірек қайталап көріңіз, сервер қазір қолжетімсіз

source: Something went wrong
kk: Бірдеңе дұрыс болмады

# tooManyRequests
source: Too many requests, please try again later
kk: Тым көп әрекет жасалынды, кейінірек қайталап көріңіз

source: Unauthorized
kk: Рұқсат берілмеген, регистрациядан өтіңіз

source: Choose time
kk: Уақытты таңдау

source: Coordinates
kk: Координаттар

source: Coordinates cannot be empty
kk: Координаттар бос болмауы керек

# fillRequiredFields
source: Fill in the required fields
kk: Міндетті өрістерді толтырыңыз

source: Invalid format
kk: Жарамсыз формат

source: Required field
kk: Міндетті толтырылуы тиіс өріс

source: Save changes
kk: Өзгерістерді сақтау

source: Address
kk: Мекенжайы

source: City
kk: Қала

source: Enter address
kk: Мекенжайды енгізіңіз

# link2GIS
source: 2GIS link
kk: 2ГИС сілтемесі

source: Location
kk: Орналасқан жері

source: Point on map
kk: Картадағы нүкте

source: Select city
kk: Қаланы таңдаңыз

source: Specify 2GIS link
kk: 2ГИС сілтемесін көрсетіңіз

source: Specify Yandex Maps link
kk: Яндекс Карталары сілтемесін көрсетіңіз

source: Yandex Maps link
kk: Яндекс Карталары сілтемесі

source: Accept payment
kk: Төлемді қабылдау

# acceptPaymentQr
source: Accept payment
kk: Төлемді қабылдау

source: Add QR
kk: QR қосу

source: Add QR payment
kk: QR-төлем қосу

source: Amount
kk: Бағасы

source: Bank name
kk: Банк атауы

# bonusInfo
source: {inputAmount} ₸ for entry, {qrAmount} ₸ for QR booking
kk: Кіру үшін {inputAmount} ₸, QR арқылы жазылу үшін {qrAmount} ₸

source: Calculate
kk: Есептеу

source: Calculator
kk: Калькулятор

source: Card number
kk: Карта нөмірі

source: Discount
kk: Жеңілдік

# discountPercentage
source: Discount: {discount}%
kk: Жеңілдік: {discount}%

source: Edit amount
kk: Бағаны өңдеу

source: Empty here
kk: Мұнда бос

source: Enter amount for withdrawal
kk: Шығару үшін бағаны енгізіңіз

source: Enter bank name
kk: Атауын енгізіңіз

source: Enter card number
kk: Карта нөмірін енгізіңіз

source: Enter correct card details
kk: Картаның дұрыс деректерін енгізіңіз

source: Expect receipt within 24 hours
kk: 24 сағат ішінде түсуін күтіңіз

source: Income calculator
kk: Кіріс калькуляторы

source: Insufficient funds for withdrawal
kk: Шығару үшін қаражат жеткіліксіз

# minWithdrawalAmount
source: Minimum withdrawal amount — {amount} ₸
kk: Шығару үшін ең төменгі баға — {amount} ₸

# minWithdrawalAmountIs
source: Minimum withdrawal amount is — {amount} ₸
kk: Ең төменгі шығару бағасы — {amount} ₸

source: Net income
kk: Таза кіріс

source: No QR payments
kk: QR төлемдері жоқ

source: Operation performed
kk: Операция орындалды

source: Other expenses
kk: Басқа шығыстар

source: Paid
kk: Төленген

# paidStatus
source: Paid
kk: Төленді

source: Payment
kk: Төлем

source: Payment method
kk: Төлем әдісі

source: Promotional price
kk: Акциялық баға

source: QR payment
kk: QR арқылы төлем

# qrPaymentHeader
source: QR Payment
kk: QR арқылы төлем

source: QR photo
kk: QR фотосуреті

source: QR scanner
kk: QR - сканер

source: Revenue from inner
kk: Ішкі кіріс

source: Revenue from outer
kk: Сыртқы кіріс

source: Revenue from queue
kk: Кезектегі кіріс

source: Salary
kk: Жалақы

source: Salary expenses
kk: Жалақы шығыстары

source: Select payment method
kk: Төлем әдісін таңдаңыз

source: Send request
kk: Сұраныс жіберу

source: Show to client to accept payment
kk: Төлемді қабылдау үшін клиентке көрсетіңіз

source: Specify amount for withdrawal
kk: Шығару үшін бағаны көрсетіңіз

source: Total
kk: Барлығы

source: Total expenses
kk: Жалпы шығыстар

source: Total revenue
kk: Жалпы кіріс

source: Withdraw funds
kk: Қаражатты шығару

source: Withdrawal of funds
kk: Қаражатты шығару

source: Withdrawal request
kk: Қаражатты шығару сұранысы

source: Withdrawal request sent for amount:
kk: Шығаруға сұраныс жіберілді, бағасы:

# withdrawalRequestSentSuccessfully
source: Withdrawal request successfully sent
kk: Қаражатты шығару сұранысы сәтті жіберілді

source: Your balance
kk: Сіздің балансыңыз

# countCars
source: {count, plural, one{{count} car} other{{count} cars}}
kk: {count, plural, one{{count} көлік} other{{count} көлік}}

# itemCount
source: {count, plural, one{{count} item} other{{count} items}}
kk: {count, plural, one{{count} дана} other{{count} дана}}

# liveQueueCars
source: {liveQueueCount, plural, one{{liveQueueCount} car in live queue} other{{liveQueueCount} cars in live queue}}
kk: {liveQueueCount} көлік тікелей кезекте

# onlineBookingCars
source: {onlineCount, plural, one{{onlineCount} car booked online} other{{onlineCount} cars booked online}}
kk: {onlineCount} онлайн жазылған көлік

# processCountCars
source: {processCount, plural, one{{processCount} car in process} other{{processCount} cars in process}}
kk: Өңделіп жатқан {processCount} көлік

# selectedGenerations
source: {selectedGenerationsLength, plural, one{{selectedGenerationsLength} generation selected} other{{selectedGenerationsLength} generations selected}}
kk: {selectedGenerationsLength, plural, one{{selectedGenerationsLength} ұрпақ таңдалды} other{{selectedGenerationsLength} ұрпақ таңдалды}}

# waitingLiveQueueCars
source: {liveQueueCount, plural, one{{liveQueueCount} car waiting (queue)} other{{liveQueueCount} cars waiting (queue)}}
kk: {liveQueueCount} көлік (кезек) күтіп тұр

# waitingOnlineBookingCars
source: {onlineCount, plural, one{{onlineCount} car waiting (online)} other{{onlineCount} cars waiting (online)}}
kk: {onlineCount} көлік (онлайн) күтіп тұр

# carCount
source: Number of cars
kk: Машина саны

source: Car washers statistics
kk: Автожуушылар статистикасы

source: Download report
kk: Есепті жүктеу

source: Report
kk: Есеп

source: Select report date
kk: Есеп күнін таңдаңыз

source: Send report
kk: Есепті жіберу

source: Total orders
kk: Барлық тапсырыстар

source: Washing statistics
kk: Жуу статистикасы

source: Add body
kk: Кузов қосу

source: Add service
kk: Қызмет қосу

source: Add service application
kk: Сервис қосуға өтінім

# addServiceButton
source: Add service
kk: Қызмет қосу

source: Application sent for moderation
kk: Өтінім модерацияға жіберілді

source: Available
kk: Қолжетімді

source: Car wash
kk: Автожуу

source: Completed
kk: Аяқталды

# created
source: New
kk: Жаңа

source: Delete selected
kk: Таңдалғандарды жою

source: Description:
kk: Cипаттамасы:

source: Draft
kk: Черновик

# enterNameForService
source: Enter service name
kk: Атауын енгізіңіз

source: Enter service description
kk: Сервис сипаттамасын енгізіңіз

source: Enter service name
kk: Сервис атауын енгізіңіз

source: Error sending application for moderation
kk: Модерацияға өтінім жіберу кезінде қате

# fillFormToSendApplication
source: Fill out the form to send an application for adding a car service. All applications are subject to verification before publication.
kk: Автосервис қосуға өтінім жіберу үшін форманы толтырыңыз. Барлық өтінімдер жарияланбас бұрын тексеруден өтеді.

# inProgress
source: In process
kk: Өңделуде

source: Main price
kk: Негізгі баға

# mainPriceDescription
source: Main price - a single service cost for cars of this body type. Separate prices can be set for different generations and models.
kk: Негізгі баға - бұл кузов түріндегі машиналар үшін қызметтің бірыңғай құны. Әртүрлі буындар мен модельдер үшін жеке бағаларды орнатуға болады.

# noServicesForSelectedCar
source: No available services for the selected car
kk: Таңдалған көліkке арналған қызметтер жоқ

source: Oil change point
kk: Май ауыстыру пункті

source: Order type
kk: Тапсырыс түрі

source: Select at least one service
kk: Кем дегенде бір қызметті таңдаңыз

source: Select bodies
kk: Кузовтарды таңдаңыз

source: Select services
kk: Қызметтерді таңдаңыз

source: Select service type
kk: Сервис түрін таңдаңыз

# selectServiceTypePrompt
source: Select service type
kk: Сервис түрін таңдаңыз

source: Select type
kk: Түрін таңдаңыз

source: Send for moderation
kk: Модерацияға жіберу

source: Separate price
kk: Бөлек баға

# separatePriceDescription
source: Separate price - the cost set specifically for the selected generation and car model
kk: Жеке баға - таңдалған буын мен автомобиль моделі үшін арнайы белгіленген құн

source: Service
kk: Қызмет

source: Service description
kk: Сервис сипаттамасы

source: Service name
kk: Сервис атауы

source: Service Operation Data
kk: Сервис жұмысы туралы деректер

source: Services
kk: Қызметтер

# servicesShort
source: Services:
kk: Қызметтер:

source: Service Type
kk: Сервис түрі

# offeringsAmount
source: Service amount
kk: Қызмет бағасы

source: Language
kk: Тіл

source: Settings
kk: Настройки

source: Currently washing
kk: Қазір жуылуда

source: Empty
kk: Бос

source: Loading...
kk: Жүктелуде...

source: New user
kk: Жаңа пайдаланушы

source: No
kk: Жоқ

source: Not paid
kk: Төленбеген

source: Not selected
kk: Таңдалмаған

source: Not specified
kk: Көрсетілмеген

source: Status
kk: Мәртебесі

source: Successfully!
kk: Сәтті!

source: Unique user
kk: Бірегей пайдаланушы

source: Unknown
kk: Белгісіз

source: Yes
kk: Иә

# closingTimeFormat
source: Closing time must be in hour:minute:second format
kk: Жабылу уақыты сағат:минут:секунд форматында болуы керек

source: Day
kk: Күн

source: End time
kk: Жұмыс аяқталу уақыты

source: Evening
kk: Кеш

source: Morning
kk: Таң

source: Night
kk: Түн

# openingTimeBeforeClosingTime
source: Opening time must be earlier than closing time
kk: Ашылу уақыты жабылу уақытынан ерте болуы керек

# openingTimeFormat
source: Opening time must be in hour:minute:second format
kk: Ашылу уақыты сағат:минут:секунд форматында болуы керек

source: Record date
kk: Жазылу күні

source: Record time
kk: Жазылу уақыты

source: Round the clock
kk: Тәулік бойы

source: Select end time
kk: Жұмыс аяқталу уақытын таңдаңыз

source: Select start time
kk: Жұмыс басталу уақытын таңдаңыз

source: Start time
kk: Жұмыс басталу уақыты

source: Work schedule
kk: Жұмыс кестесі

source: Coming soon
kk: Жақында

# confirmButton
source: Confirm
kk: Растау

source: Filters
kk: Сүзгілер

source: Name
kk: Аты

source: Nothing found
kk: Ештеңе табылмады

source: Record
kk: Жазылу

source: Enter amount
kk: Бағасын енгізіңіз

source: Number of boxes
kk: Бокстар саны

source: Number of boxes must be greater than zero
kk: Бокстар саны нөлден көп болуы керек

# numberOfBoxesMustBeNumber
source: Number of boxes must be a number
kk: Бокстар саны сан болуы керек

# someFilesExceedMaxSize
source: Some files exceed the maximum size of 10 MB
kk: Кейбір файлдар максималды 10 МБ өлшемінен асады

# specifyNumberOfBoxes
source: Specify the number of boxes
kk: Бокстар санын көрсетіңіз

# confirmCompleteWashing
source: Are you sure you want to complete washing?
kk: Жууды аяқтағыңыз келетініне сенімдісіз бе?

# confirmDeleteRecord
source: Are you sure you want to delete this record?
kk: Бұл жазылуды жойғыңыз келетініне сенімдісіз бе?

# confirmStartWashing
source: Are you sure you want to start washing?
kk: Жууды бастағыңыз келетініне сенімдісіз бе?

source: Complete washing
kk: Жууды аяқтау

# completeWashingPrompt
source: To complete the wash, you must first pay for the order
kk: Жууды аяқтау үшін алдымен тапсырысты төлеу қажет

source: Delete record
kk: Жазылуды жою

# orderAlreadyScanned
source: This order has already been scanned
kk: Бұл тапсырыс қазірдің өзінде сканерленген

# orderCannotBeScanned
source: This order cannot be scanned
kk: Бұл тапсырысты сканерлеу мүмкін емес

# orderInfo
source: Order information
kk: Тапсырыс туралы ақпарат

# selectCarWasherPrompt
source: Please select a car washer before starting the order
kk: Тапсырысты бастамас бұрын автожуушыны таңдаңыз

source: Start washing
kk: Жууды бастау

# addConveniences
source: Add convenience
kk: Ыңғайлылық қосу

source: Add photos
kk: Фотосуреттер қосу

# cashRegisterMenu
source: Cash register
kk: Касса

source: Conveniences
kk: Ыңғайлылықтар

source: Do not accept orders
kk: Тапсырыстарды қабылдамау

source: Main Information
kk: Негізгі ақпарат

source: Notifications
kk: Хабарламалар

# notificationsMenu
source: Notifications
kk: Хабарламалар

source: Organization
kk: Ұйым

# organizationMenu
source: Organization
kk: Ұйым

source: Photos
kk: Фотосуреттер

source: Select conveniences
kk: Ыңғайлылықтарды таңдау

source: Tech support
kk: Техникалық қолдау

source: Call
kk: Қоңырау шалу

source: Comment:
kk: Пікір:

source: Delete account
kk: Тіркелімді жою

# deleteAccountConfirmation
source: Are you sure you want to send a request to delete your account?
kk: Тіркелімді жою сұранысын жібергіңіз келетініне сенімдісіз бе?

# deleteAccountRequestSent
source: Account deletion request has been sent. Please wait for confirmation.
kk: Тіркелімді жою сұранысы жіберілді. Растауды күтіңіз.

# deleteAccountTitle
source: Delete account
kk: Тіркелімді жою

source: Logout
kk: Шығу

source: Reply:
kk: Жауап:

source: Reply to review
kk: Пікірге жауап беру

source: Reply to review added
kk: Пікірге жауап қосылды

source: Respond
kk: Жауап беру

source: Reviews
kk: Пікірлер

source: Reviews and ratings
kk: Пікірлер мен рейтингтер

# thanksForReviewSeeYouAgain
source: Thank you for your review! We look forward to seeing you again
kk: Пікіріңіз үшін рахмет! Сізді қайта көргенімізге қуаныштымыз

source: Write on WhatsApp
kk: WhatsApp-қа жазу

# yourReplyShowsServiceLevel
source: Your reply will help show the level of service and attitude towards clients
kk: Сіздің жауабыңыз қызмет көрсету деңгейін және клиенттерге қарым-қатынасты көрсетуге көмектеседі
